apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k144_pinmux.h
#define PIN_FTM0_CH0_1            (PIN_ALT2   | PIN_PORTB | PIN12)
#define PIN_FTM0_CH0_2            (PIN_ALT2   | PIN_PORTC | PIN0)
#define PIN_FTM0_CH0_3            (PIN_ALT2   | PIN_PORTD | PIN15)
#define PIN_FTM0_CH1_1            (PIN_ALT2   | PIN_PORTB | PIN13)
#define PIN_FTM0_CH1_2            (PIN_ALT2   | PIN_PORTC | PIN1)
#define PIN_FTM0_CH1_3            (PIN_ALT2   | PIN_PORTD | PIN16)
#define PIN_FTM0_CH2_1            (PIN_ALT2   | PIN_PORTB | PIN14)
#define PIN_FTM0_CH2_2            (PIN_ALT2   | PIN_PORTC | PIN2)
#define PIN_FTM0_CH2_3            (PIN_ALT2   | PIN_PORTD | PIN0)
#define PIN_FTM0_CH3_1            (PIN_ALT2   | PIN_PORTB | PIN15)
#define PIN_FTM0_CH3_2            (PIN_ALT2   | PIN_PORTC | PIN3)
#define PIN_FTM0_CH3_3            (PIN_ALT2   | PIN_PORTD | PIN1)
#define PIN_FTM0_CH4_1            (PIN_ALT2   | PIN_PORTB | PIN16)
#define PIN_FTM0_CH4_2            (PIN_ALT2   | PIN_PORTB | PIN4)
#define PIN_FTM0_CH5_1            (PIN_ALT2   | PIN_PORTB | PIN17)
#define PIN_FTM0_CH5_2            (PIN_ALT2   | PIN_PORTB | PIN5)
#define PIN_FTM0_CH6_1            (PIN_ALT2   | PIN_PORTA | PIN17)
#define PIN_FTM0_CH6_2            (PIN_ALT2   | PIN_PORTE | PIN8)
#define PIN_FTM0_CH7_1            (PIN_ALT2   | PIN_PORTE | PIN7)
#define PIN_FTM0_CH7_2            (PIN_ALT2   | PIN_PORTE | PIN9)
#define PIN_FTM0_FLT0_1           (PIN_ALT2   | PIN_PORTA | PIN14)
#define PIN_FTM0_FLT0_2           (PIN_ALT2   | PIN_PORTE | PIN3)
#define PIN_FTM0_FLT1_1           (PIN_ALT2   | PIN_PORTA | PIN6)
#define PIN_FTM0_FLT1_2           (PIN_ALT2   | PIN_PORTE | PIN14)
#define PIN_FTM0_FLT2_1           (PIN_ALT2   | PIN_PORTA | PIN7)
#define PIN_FTM0_FLT2_2           (PIN_ALT2   | PIN_PORTD | PIN17)
#define PIN_FTM0_FLT3_1           (PIN_ALT2   | PIN_PORTD | PIN4)
#define PIN_FTM0_FLT3_2           (PIN_ALT2   | PIN_PORTE | PIN12)

#define PIN_FTM1_CH0_1            (PIN_ALT2   | PIN_PORTB | PIN2)
#define PIN_FTM1_CH0_2            (PIN_ALT2   | PIN_PORTC | PIN4)
#define PIN_FTM1_CH1_1            (PIN_ALT2   | PIN_PORTA | PIN1)
#define PIN_FTM1_CH1_2            (PIN_ALT2   | PIN_PORTB | PIN3)
#define PIN_FTM1_CH2_1            (PIN_ALT2   | PIN_PORTA | PIN15)
#define PIN_FTM1_CH2_2            (PIN_ALT2   | PIN_PORTC | PIN14)
#define PIN_FTM1_CH3_1            (PIN_ALT2   | PIN_PORTA | PIN16)
#define PIN_FTM1_CH3_2            (PIN_ALT2   | PIN_PORTC | PIN15)
#define PIN_FTM1_CH4_1            (PIN_ALT2   | PIN_PORTA | PIN10)
#define PIN_FTM1_CH4_2            (PIN_ALT6   | PIN_PORTD | PIN8)
#define PIN_FTM1_CH5_1            (PIN_ALT2   | PIN_PORTA | PIN11)
#define PIN_FTM1_CH5_2            (PIN_ALT6   | PIN_PORTD | PIN9)
#define PIN_FTM1_CH6_1            (PIN_ALT2   | PIN_PORTA | PIN12)
#define PIN_FTM1_CH6_2            (PIN_ALT6   | PIN_PORTC | PIN0)
#define PIN_FTM1_CH7_1            (PIN_ALT2   | PIN_PORTA | PIN13)
#define PIN_FTM1_CH7_2            (PIN_ALT6   | PIN_PORTC | PIN1)
#define PIN_FTM1_FLT0_1           (PIN_ALT3   | PIN_PORTC | PIN8)
#define PIN_FTM1_FLT0_2           (PIN_ALT6   | PIN_PORTA | PIN14)
#define PIN_FTM1_FLT1_1           (PIN_ALT3   | PIN_PORTC | PIN9)
#define PIN_FTM1_FLT1_2           (PIN_ALT6   | PIN_PORTE | PIN1)
#define PIN_FTM1_FLT2_1           (PIN_ALT2   | PIN_PORTC | PIN16)
#define PIN_FTM1_FLT2_2           (PIN_ALT6   | PIN_PORTE | PIN0)
#define PIN_FTM1_FLT3_1           (PIN_ALT2   | PIN_PORTC | PIN17)
#define PIN_FTM1_FLT3_2           (PIN_ALT6   | PIN_PORTA | PIN9)
#define PIN_FTM1_QD_PHA_1         (PIN_ALT4   | PIN_PORTB | PIN3)
#define PIN_FTM1_QD_PHA_2         (PIN_ALT5   | PIN_PORTA | PIN1)
#define PIN_FTM1_QD_PHA_3         (PIN_ALT6   | PIN_PORTC | PIN7)
#define PIN_FTM1_QD_PHB_1         (PIN_ALT4   | PIN_PORTB | PIN2)
#define PIN_FTM1_QD_PHB_2         (PIN_ALT6   | PIN_PORTC | PIN4)
#define PIN_FTM1_QD_PHB_3         (PIN_ALT6   | PIN_PORTC | PIN6)

#define PIN_FTM2_CH0_1            (PIN_ALT2   | PIN_PORTC | PIN5)
#define PIN_FTM2_CH0_2            (PIN_ALT2   | PIN_PORTD | PIN10)
#define PIN_FTM2_CH0_3            (PIN_ALT4   | PIN_PORTD | PIN0)
#define PIN_FTM2_CH1_1            (PIN_ALT2   | PIN_PORTA | PIN0)
#define PIN_FTM2_CH1_2            (PIN_ALT2   | PIN_PORTD | PIN11)
#define PIN_FTM2_CH1_3            (PIN_ALT4   | PIN_PORTD | PIN1)
#define PIN_FTM2_CH2_1            (PIN_ALT2   | PIN_PORTD | PIN12)
#define PIN_FTM2_CH2_2            (PIN_ALT4   | PIN_PORTE | PIN4)
#define PIN_FTM2_CH3_1            (PIN_ALT2   | PIN_PORTD | PIN5)
#define PIN_FTM2_CH3_2            (PIN_ALT4   | PIN_PORTE | PIN5)
#define PIN_FTM2_CH4_1            (PIN_ALT2   | PIN_PORTD | PIN13)
#define PIN_FTM2_CH4_2            (PIN_ALT4   | PIN_PORTE | PIN10)
#define PIN_FTM2_CH5_1            (PIN_ALT2   | PIN_PORTD | PIN14)
#define PIN_FTM2_CH5_2            (PIN_ALT4   | PIN_PORTE | PIN11)
#define PIN_FTM2_CH6_1            (PIN_ALT3   | PIN_PORTC | PIN12)
#define PIN_FTM2_CH6_2            (PIN_ALT4   | PIN_PORTE | PIN15)
#define PIN_FTM2_CH7_1            (PIN_ALT3   | PIN_PORTC | PIN13)
#define PIN_FTM2_CH7_2            (PIN_ALT4   | PIN_PORTE | PIN16)
#define PIN_FTM2_FLT0_1           (PIN_ALT4   | PIN_PORTE | PIN13)
#define PIN_FTM2_FLT0_2           (PIN_ALT4   | PIN_PORTE | PIN3)
#define PIN_FTM2_FLT1_1           (PIN_ALT4   | PIN_PORTD | PIN5)
#define PIN_FTM2_FLT1_2           (PIN_ALT4   | PIN_PORTE | PIN14)
#define PIN_FTM2_FLT2_1           (PIN_ALT4   | PIN_PORTD | PIN6)
#define PIN_FTM2_FLT2_2           (PIN_ALT4   | PIN_PORTD | PIN8)
#define PIN_FTM2_FLT3_1           (PIN_ALT4   | PIN_PORTD | PIN7)
#define PIN_FTM2_FLT3_2           (PIN_ALT4   | PIN_PORTD | PIN9)
#define PIN_FTM2_QD_PHA_1         (PIN_ALT3   | PIN_PORTD | PIN11)
#define PIN_FTM2_QD_PHA_2         (PIN_ALT3   | PIN_PORTE | PIN5)
#define PIN_FTM2_QD_PHA_3         (PIN_ALT5   | PIN_PORTA | PIN0)
#define PIN_FTM2_QD_PHA_4         (PIN_ALT6   | PIN_PORTA | PIN13)
#define PIN_FTM2_QD_PHB_1         (PIN_ALT3   | PIN_PORTD | PIN10)
#define PIN_FTM2_QD_PHB_2         (PIN_ALT3   | PIN_PORTE | PIN4)
#define PIN_FTM2_QD_PHB_3         (PIN_ALT6   | PIN_PORTA | PIN12)
#define PIN_FTM2_QD_PHB_4         (PIN_ALT6   | PIN_PORTC | PIN5)

#define PIN_FTM3_CH0_1            (PIN_ALT2   | PIN_PORTA | PIN2)
#define PIN_FTM3_CH0_2            (PIN_ALT2   | PIN_PORTB | PIN8)
#define PIN_FTM3_CH1_1            (PIN_ALT2   | PIN_PORTA | PIN3)
#define PIN_FTM3_CH1_2            (PIN_ALT2   | PIN_PORTB | PIN9)
#define PIN_FTM3_CH2_1            (PIN_ALT2   | PIN_PORTB | PIN10)
#define PIN_FTM3_CH2_2            (PIN_ALT4   | PIN_PORTC | PIN6)
#define PIN_FTM3_CH3_1            (PIN_ALT2   | PIN_PORTB | PIN11)
#define PIN_FTM3_CH3_2            (PIN_ALT4   | PIN_PORTC | PIN7)
#define PIN_FTM3_CH4_1            (PIN_ALT2   | PIN_PORTC | PIN10)
#define PIN_FTM3_CH4_2            (PIN_ALT2   | PIN_PORTD | PIN2)
#define PIN_FTM3_CH5_1            (PIN_ALT2   | PIN_PORTC | PIN11)
#define PIN_FTM3_CH5_2            (PIN_ALT2   | PIN_PORTD | PIN3)
#define PIN_FTM3_CH6_1            (PIN_ALT2   | PIN_PORTC | PIN12)
#define PIN_FTM3_CH6_2            (PIN_ALT4   | PIN_PORTE | PIN2)
#define PIN_FTM3_CH7_1            (PIN_ALT2   | PIN_PORTC | PIN13)
#define PIN_FTM3_CH7_2            (PIN_ALT4   | PIN_PORTE | PIN6)
#define PIN_FTM3_FLT0_1           (PIN_ALT3   | PIN_PORTA | PIN17)
#define PIN_FTM3_FLT0_2           (PIN_ALT3   | PIN_PORTE | PIN7)
#define PIN_FTM3_FLT1_1           (PIN_ALT3   | PIN_PORTA | PIN14)
#define PIN_FTM3_FLT1_2           (PIN_ALT3   | PIN_PORTB | PIN13)
#define PIN_FTM3_FLT2_1           (PIN_ALT3   | PIN_PORTB | PIN12)
#define PIN_FTM3_FLT2_2           (PIN_ALT5   | PIN_PORTA | PIN9)
#define PIN_FTM3_FLT3_1           (PIN_ALT3   | PIN_PORTD | PIN4)
#define PIN_FTM3_FLT3_2           (PIN_ALT5   | PIN_PORTA | PIN8)

