apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k144_pinmux.h
/* FlexIO */

#define PIN_FXIO_D0_1             (PIN_ALT3   | PIN_PORTD | PIN9)
#define PIN_FXIO_D0_2             (PIN_ALT4   | PIN_PORTA | PIN10)
#define PIN_FXIO_D0_3             (PIN_ALT6   | PIN_PORTD | PIN0)
#define PIN_FXIO_D1_1             (PIN_ALT4   | PIN_PORTA | PIN11)
#define PIN_FXIO_D1_2             (PIN_ALT5   | PIN_PORTD | PIN8)
#define PIN_FXIO_D1_3             (PIN_ALT6   | PIN_PORTD | PIN1)
#define PIN_FXIO_D2_1             (PIN_ALT4   | PIN_PORTA | PIN0)
#define PIN_FXIO_D2_2             (PIN_ALT6   | PIN_PORTE | PIN15)
#define PIN_FXIO_D3_1             (PIN_ALT4   | PIN_PORTA | PIN1)
#define PIN_FXIO_D3_2             (PIN_ALT6   | PIN_PORTE | PIN16)
#define PIN_FXIO_D4_1             (PIN_ALT4   | PIN_PORTD | PIN2)
#define PIN_FXIO_D4_2             (PIN_ALT5   | PIN_PORTA | PIN2)
#define PIN_FXIO_D4_3             (PIN_ALT6   | PIN_PORTE | PIN10)
#define PIN_FXIO_D5_1             (PIN_ALT4   | PIN_PORTD | PIN3)
#define PIN_FXIO_D5_2             (PIN_ALT5   | PIN_PORTA | PIN3)
#define PIN_FXIO_D5_3             (PIN_ALT6   | PIN_PORTE | PIN11)
#define PIN_FXIO_D6_1             (PIN_ALT4   | PIN_PORTA | PIN8)
#define PIN_FXIO_D6_2             (PIN_ALT5   | PIN_PORTD | PIN2)
#define PIN_FXIO_D6_3             (PIN_ALT6   | PIN_PORTE | PIN4)
#define PIN_FXIO_D7_1             (PIN_ALT4   | PIN_PORTA | PIN9)
#define PIN_FXIO_D7_2             (PIN_ALT5   | PIN_PORTD | PIN3)
#define PIN_FXIO_D7_3             (PIN_ALT6   | PIN_PORTE | PIN5)

/* JTAG */

#define PIN_JTAG_TCLK             (PIN_ALT7   | PIN_PORTC | PIN4)
#define PIN_JTAG_TDI              (PIN_ALT7   | PIN_PORTC | PIN5)
#define PIN_JTAG_TDO              (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_JTAG_TMS              (PIN_ALT7   | PIN_PORTA | PIN4)

/* LPI2C */

#define PIN_LPI2C0_HREQ_1         (PIN_ALT3   | PIN_PORTB | PIN11)
#define PIN_LPI2C0_HREQ_2         (PIN_ALT3   | PIN_PORTE | PIN1)
#define PIN_LPI2C0_SCL_1          (PIN_ALT2   | PIN_PORTB | PIN7)
#define PIN_LPI2C0_SCL_2          (PIN_ALT3   | PIN_PORTA | PIN3)
#define PIN_LPI2C0_SCLS_1         (PIN_ALT3   | PIN_PORTA | PIN0)
#define PIN_LPI2C0_SCLS_2         (PIN_ALT3   | PIN_PORTB | PIN9)
#define PIN_LPI2C0_SDA_1          (PIN_ALT2   | PIN_PORTB | PIN6)
#define PIN_LPI2C0_SDA_2          (PIN_ALT3   | PIN_PORTA | PIN2)
#define PIN_LPI2C0_SDAS_1         (PIN_ALT3   | PIN_PORTA | PIN1)
#define PIN_LPI2C0_SDAS_2         (PIN_ALT3   | PIN_PORTB | PIN10)

/* LPSPI */

#define PIN_LPSPI0_PCS0_1         (PIN_ALT3   | PIN_PORTB | PIN0)
#define PIN_LPSPI0_PCS0_2         (PIN_ALT4   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS1           (PIN_ALT3   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS2           (PIN_ALT2   | PIN_PORTE | PIN6)
#define PIN_LPSPI0_PCS3           (PIN_ALT3   | PIN_PORTA | PIN15)
#define PIN_LPSPI0_SCK_1          (PIN_ALT2   | PIN_PORTE | PIN0)
#define PIN_LPSPI0_SCK_2          (PIN_ALT3   | PIN_PORTB | PIN2)
#define PIN_LPSPI0_SCK_3          (PIN_ALT4   | PIN_PORTD | PIN15)
#define PIN_LPSPI0_SIN_1          (PIN_ALT2   | PIN_PORTE | PIN1)
#define PIN_LPSPI0_SIN_2          (PIN_ALT3   | PIN_PORTB | PIN3)
#define PIN_LPSPI0_SIN_3          (PIN_ALT4   | PIN_PORTD | PIN16)
#define PIN_LPSPI0_SOUT_1         (PIN_ALT2   | PIN_PORTE | PIN2)
#define PIN_LPSPI0_SOUT_2         (PIN_ALT3   | PIN_PORTB | PIN1)
#define PIN_LPSPI0_SOUT_3         (PIN_ALT3   | PIN_PORTB | PIN4)

#define PIN_LPSPI1_PCS0_1         (PIN_ALT3   | PIN_PORTD | PIN3)
#define PIN_LPSPI1_PCS0_2         (PIN_ALT5   | PIN_PORTE | PIN1)
#define PIN_LPSPI1_PCS1           (PIN_ALT3   | PIN_PORTA | PIN6)
#define PIN_LPSPI1_PCS2           (PIN_ALT3   | PIN_PORTA | PIN16)
#define PIN_LPSPI1_PCS3           (PIN_ALT3   | PIN_PORTB | PIN17)
#define PIN_LPSPI1_SCK_1          (PIN_ALT3   | PIN_PORTB | PIN14)
#define PIN_LPSPI1_SCK_2          (PIN_ALT3   | PIN_PORTD | PIN0)
#define PIN_LPSPI1_SIN_1          (PIN_ALT3   | PIN_PORTB | PIN15)
#define PIN_LPSPI1_SIN_2          (PIN_ALT3   | PIN_PORTD | PIN1)
#define PIN_LPSPI1_SOUT_1         (PIN_ALT3   | PIN_PORTB | PIN16)
#define PIN_LPSPI1_SOUT_2         (PIN_ALT3   | PIN_PORTD | PIN2)
#define PIN_LPSPI1_SOUT_3         (PIN_ALT5   | PIN_PORTE | PIN0)

#define PIN_LPSPI2_PCS0_1         (PIN_ALT2   | PIN_PORTE | PIN11)
#define PIN_LPSPI2_PCS0_2         (PIN_ALT3   | PIN_PORTA | PIN9)
#define PIN_LPSPI2_PCS0_3         (PIN_ALT3   | PIN_PORTC | PIN14)
#define PIN_LPSPI2_PCS1           (PIN_ALT3   | PIN_PORTE | PIN10)
#define PIN_LPSPI2_PCS2           (PIN_ALT3   | PIN_PORTE | PIN13)
#define PIN_LPSPI2_PCS3           (PIN_ALT4   | PIN_PORTA | PIN15)
#define PIN_LPSPI2_SCK_1          (PIN_ALT3   | PIN_PORTC | PIN15)
#define PIN_LPSPI2_SCK_2          (PIN_ALT3   | PIN_PORTE | PIN15)
#define PIN_LPSPI2_SIN_1          (PIN_ALT3   | PIN_PORTC | PIN0)
#define PIN_LPSPI2_SIN_2          (PIN_ALT3   | PIN_PORTE | PIN16)
#define PIN_LPSPI2_SOUT_1         (PIN_ALT3   | PIN_PORTA | PIN8)
#define PIN_LPSPI2_SOUT_2         (PIN_ALT3   | PIN_PORTC | PIN1)

/* LPTimer */

#define PIN_LPTMR0_ALT1           (PIN_ALT3   | PIN_PORTE | PIN11)
#define PIN_LPTMR0_ALT2           (PIN_ALT3   | PIN_PORTD | PIN5)
#define PIN_LPTMR0_ALT3_1         (PIN_ALT3   | PIN_PORTE | PIN2)
#define PIN_LPTMR0_ALT3_2         (PIN_ALT4   | PIN_PORTB | PIN0)

/* LPUARTS */

#define PIN_LPUART0_CTS_1         (PIN_ALT6   | PIN_PORTA | PIN0)
#define PIN_LPUART0_CTS_2         (PIN_ALT6   | PIN_PORTC | PIN8)
#define PIN_LPUART0_RTS_1         (PIN_ALT6   | PIN_PORTA | PIN1)
#define PIN_LPUART0_RTS_2         (PIN_ALT6   | PIN_PORTC | PIN9)
#define PIN_LPUART0_RX_1          (PIN_ALT2   | PIN_PORTB | PIN0)
#define PIN_LPUART0_RX_2          (PIN_ALT4   | PIN_PORTC | PIN2)
#define PIN_LPUART0_RX_3          (PIN_ALT6   | PIN_PORTA | PIN2)
#define PIN_LPUART0_TX_1          (PIN_ALT2   | PIN_PORTB | PIN1)
#define PIN_LPUART0_TX_2          (PIN_ALT4   | PIN_PORTC | PIN3)
#define PIN_LPUART0_TX_3          (PIN_ALT6   | PIN_PORTA | PIN3)

#define PIN_LPUART1_CTS_1         (PIN_ALT2   | PIN_PORTE | PIN15)
#define PIN_LPUART1_CTS_2         (PIN_ALT6   | PIN_PORTA | PIN6)
#define PIN_LPUART1_CTS_3         (PIN_ALT6   | PIN_PORTE | PIN2)
#define PIN_LPUART1_RTS_1         (PIN_ALT2   | PIN_PORTE | PIN16)
#define PIN_LPUART1_RTS_2         (PIN_ALT6   | PIN_PORTA | PIN7)
#define PIN_LPUART1_RTS_3         (PIN_ALT6   | PIN_PORTE | PIN6)
#define PIN_LPUART1_RX_1          (PIN_ALT2   | PIN_PORTC | PIN6)
#define PIN_LPUART1_RX_2          (PIN_ALT2   | PIN_PORTC | PIN8)
#define PIN_LPUART1_RX_3          (PIN_ALT3   | PIN_PORTD | PIN13)
#define PIN_LPUART1_TX_1          (PIN_ALT2   | PIN_PORTC | PIN7)
#define PIN_LPUART1_TX_2          (PIN_ALT2   | PIN_PORTC | PIN9)
#define PIN_LPUART1_TX_3          (PIN_ALT3   | PIN_PORTD | PIN14)

#define PIN_LPUART2_CTS_1         (PIN_ALT3   | PIN_PORTE | PIN9)
#define PIN_LPUART2_CTS_2         (PIN_ALT4   | PIN_PORTC | PIN12)
#define PIN_LPUART2_CTS_3         (PIN_ALT6   | PIN_PORTD | PIN11)
#define PIN_LPUART2_RTS_1         (PIN_ALT3   | PIN_PORTE | PIN3)
#define PIN_LPUART2_RTS_2         (PIN_ALT4   | PIN_PORTC | PIN13)
#define PIN_LPUART2_RTS_3         (PIN_ALT6   | PIN_PORTD | PIN12)
#define PIN_LPUART2_RX_1          (PIN_ALT2   | PIN_PORTA | PIN8)
#define PIN_LPUART2_RX_2          (PIN_ALT2   | PIN_PORTD | PIN6)
#define PIN_LPUART2_RX_3          (PIN_ALT3   | PIN_PORTD | PIN17)
#define PIN_LPUART2_TX_1          (PIN_ALT2   | PIN_PORTA | PIN9)
#define PIN_LPUART2_TX_2          (PIN_ALT2   | PIN_PORTD | PIN7)
#define PIN_LPUART2_TX_3          (PIN_ALT3   | PIN_PORTE | PIN12)

